run/cases/pelletExtruder/AMI/SHMremeshed/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "pcorr.*"
    {
        $p;
        tolerance       1e-3;
        relTol          0;
    }

    "(rho|U|h|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(rho|U|h|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    consistent          true;
    nOuterCorrectors    10;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;

    outerCorrectorResidualControl
    {
        p 
        {
            tolerance   1e-3;
            relTol      0;
        }
        T
        {
            tolerance   1e-3;
            relTol      0;
        }
    }
}

relaxationFactors
{
    fields
    {}

    equations
    {
        p       1;      // Make matrix at least diagonal dominant
        U       0.95;
    }
}


// ************************************************************************* //
