run/cases/pelletExtruder/AMI/SHMremeshed/system/surfaceFeatureExtractDictDefaults
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDictDefaults;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

extractionMethod    extractFromSurface;

extractFromSurfaceCoeffs
{
    includedAngle   180;  // Identifes a feature when angle
}                         // between faces < includedAngle

writeObj            yes;  // writes out .obj files to view features

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
